from math import factorial
import numpy as np


def combine(val, all):
    return factorial(val) / (factorial(all) * factorial(val - all))


"""
Даны значения зарплат из выборки выпускников: 
100, 80, 75, 77, 89, 33, 45, 25, 65, 17, 30, 24, 57, 55, 70, 75, 65, 84, 90, 150. 
Посчитать (желательно без использования статистических методов наподобие std, var, mean) 
среднее арифметическое, среднее квадратичное отклонение, смещенную и несмещенную оценки дисперсий для данной выборки.
"""

s_array = [100, 80, 75, 77, 89, 33, 45, 25, 65, 17, 30, 24, 57, 55, 70, 75, 65, 84, 90, 150]
average = (sum(s_array)) / len(s_array)
square_average = (sum(s_array - ))